AlexLanzano/wolfHAL/src/crypto/stm32f4_hash.c
/* stm32f4_hash.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfHAL.
 *
 * wolfHAL is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfHAL is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include <stdint.h>
#include "board.h"  /* provides WHAL_CFG_STM32F4_HASH*_DEV initializers */
#include <wolfHAL/crypto/stm32f4_hash.h>
#include <wolfHAL/crypto/crypto.h>
#include <wolfHAL/error.h>
#include <wolfHAL/reg.h>
#include <wolfHAL/bitops.h>
#include <wolfHAL/endian.h>

const whal_Crypto     whal_Stm32f4_Hash_Dev       = WHAL_CFG_STM32F4_HASH_DEV;
const whal_Sha1       whal_Stm32f4_Sha1_Dev       = WHAL_CFG_STM32F4_HASH_SHA1_DEV;
const whal_Sha224     whal_Stm32f4_Sha224_Dev     = WHAL_CFG_STM32F4_HASH_SHA224_DEV;
const whal_Sha256     whal_Stm32f4_Sha256_Dev     = WHAL_CFG_STM32F4_HASH_SHA256_DEV;
const whal_HmacSha1   whal_Stm32f4_HmacSha1_Dev   = WHAL_CFG_STM32F4_HASH_HMAC_SHA1_DEV;
const whal_HmacSha224 whal_Stm32f4_HmacSha224_Dev = WHAL_CFG_STM32F4_HASH_HMAC_SHA224_DEV;
const whal_HmacSha256 whal_Stm32f4_HmacSha256_Dev = WHAL_CFG_STM32F4_HASH_HMAC_SHA256_DEV;

/*
 * STM32F4 (F42xxx/F43xxx) HASH register map (RM0090 §25.4.2 for the
 * F43xxx CR variant, §25.4.5 for HR0..7 at 0x310..0x32C).
 *
 *   CR    @ 0x00
 *   DIN   @ 0x04
 *   STR   @ 0x08
 *   SR    @ 0x24
 *   HR0..4 (legacy aliases) @ 0x0C..0x1C
 *   HR0..7 (canonical)       @ 0x310..0x32C
 *
 * CR bit layout differs from STM32WBA HASH only in ALGO: F4 splits it
 * across bit 18 (MSB) and bit 7 (LSB) rather than the contiguous bits
 * 18:17 used by WBA. The encoding values are unchanged:
 *   00 = SHA-1, 01 = MD5, 10 = SHA-224, 11 = SHA-256.
 *
 * DATATYPE on F4 lives at bits 5:4 (RM0090 §25.4.2) — the same position as
 * STM32WBA HASH after cross-checking the textual prose against the figure.
 */

/* Control Register */
#define HASH_CR_REG           0x00

#define HASH_CR_INIT_Pos      2
#define HASH_CR_INIT_Msk      (1UL << HASH_CR_INIT_Pos)

#define HASH_CR_DMAE_Pos      3
#define HASH_CR_DMAE_Msk      (1UL << HASH_CR_DMAE_Pos)

#define HASH_CR_DATATYPE_Pos  4
#define HASH_CR_DATATYPE_Msk  (3UL << HASH_CR_DATATYPE_Pos)

#define HASH_CR_MODE_Pos      6
#define HASH_CR_MODE_Msk      (1UL << HASH_CR_MODE_Pos)

/* ALGO is split: ALGO[0] at bit 7, ALGO[1] at bit 18 (RM0090 §25.4.2). */
#define HASH_CR_ALGO0_Pos     7
#define HASH_CR_ALGO0_Msk     (1UL << HASH_CR_ALGO0_Pos)
#define HASH_CR_ALGO1_Pos     18
#define HASH_CR_ALGO1_Msk     (1UL << HASH_CR_ALGO1_Pos)
#define HASH_CR_ALGO_Msk      (HASH_CR_ALGO0_Msk | HASH_CR_ALGO1_Msk)

#define HASH_CR_LKEY_Pos      16
#define HASH_CR_LKEY_Msk      (1UL << HASH_CR_LKEY_Pos)

/* Data Input Register */
#define HASH_DIN_REG          0x04

/* Start Register */
#define HASH_STR_REG          0x08

#define HASH_STR_NBLW_Pos     0
#define HASH_STR_NBLW_Msk     (0x1FUL << HASH_STR_NBLW_Pos)

#define HASH_STR_DCAL_Pos     8
#define HASH_STR_DCAL_Msk     (1UL << HASH_STR_DCAL_Pos)

/* Status Register */
#define HASH_SR_REG           0x24

#define HASH_SR_BUSY_Pos      3
#define HASH_SR_BUSY_Msk      (1UL << HASH_SR_BUSY_Pos)

/* Digest Result Registers (canonical F43xxx mapping at 0x310..0x32C). */
#define HASH_HR_BASE_REG      0x310

/* Algorithm encoding (CR ALGO field value, before splitting). */
#define HASH_ALGO_SHA1        0
#define HASH_ALGO_MD5         1
#define HASH_ALGO_SHA224      2
#define HASH_ALGO_SHA256      3

#define HASH_MODE_HASH        0
#define HASH_MODE_HMAC        1

/* Per-driver HMAC state surviving Start→Finalize. Singleton drivers so static. */
static whal_Stm32f4_HmacSha1_State   g_hmacSha1State;
static whal_Stm32f4_HmacSha224_State g_hmacSha224State;
static whal_Stm32f4_HmacSha256_State g_hmacSha256State;

/* Single-instance HASH peripheral — shared 0-3 byte staging buffer is enough
 * since only one streaming session can be live at a time. Process tops it up
 * to a full word and pushes; Finalize drains it as the last partial word. */
static uint8_t g_streamBuf[4];
static size_t  g_streamBufBytes;

/* Encode a 2-bit ALGO value into its split CR positions. */
static uint32_t AlgoBits(size_t algo)
{
    return whal_SetBits(HASH_CR_ALGO0_Msk, HASH_CR_ALGO0_Pos, algo & 1) |
           whal_SetBits(HASH_CR_ALGO1_Msk, HASH_CR_ALGO1_Pos, (algo >> 1) & 1);
}

static whal_Error WaitForReady(size_t base, whal_Timeout *timeout)
{
    return whal_Reg_ReadPoll(base, HASH_SR_REG, HASH_SR_BUSY_Msk, 0, timeout);
}

/* Reset the stream staging buffer; called from each Start. */
static void StreamReset(void)
{
    g_streamBufBytes = 0;
}

/* Accumulate Process input — same algorithm as the STM32WBA HASH driver. */
static void StreamWrite(size_t base, const uint8_t *in, size_t inSz)
{
    if (g_streamBufBytes > 0) {
        while (g_streamBufBytes < 4 && inSz > 0) {
            g_streamBuf[g_streamBufBytes++] = *in++;
            inSz--;
        }
        if (g_streamBufBytes == 4) {
            whal_Reg_Write(base, HASH_DIN_REG, whal_LoadBe32(g_streamBuf));
            g_streamBufBytes = 0;
        }
    }

    while (inSz >= 4) {
        whal_Reg_Write(base, HASH_DIN_REG, whal_LoadBe32(in));
        in += 4;
        inSz -= 4;
    }

    while (inSz > 0) {
        g_streamBuf[g_streamBufBytes++] = *in++;
        inSz--;
    }
}

/* Push inSz bytes immediately before issuing DCAL: full words first, then
 * if any trailing bytes remain, set NBLW and push one partial word. */
static void WriteTail(size_t base, const uint8_t *in, size_t inSz)
{
    while (inSz >= 4) {
        whal_Reg_Write(base, HASH_DIN_REG, whal_LoadBe32(in));
        in += 4;
        inSz -= 4;
    }

    if (inSz > 0) {
        whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk,
                        whal_SetBits(HASH_STR_NBLW_Msk, HASH_STR_NBLW_Pos,
                                     inSz * 8));
        whal_Reg_Write(base, HASH_DIN_REG, whal_LoadBe32Partial(in, inSz));
    }
}

/* Drain any buffered 0-3 trailing bytes as the final partial word right
 * before DCAL; sets NBLW correctly via WriteTail. */
static void StreamDrain(size_t base)
{
    WriteTail(base, g_streamBuf, g_streamBufBytes);
    g_streamBufBytes = 0;
}

