AlexLanzano/wolfHAL/src/crypto/stm32f4_hash.c
static void ReadDigest(size_t base, uint8_t *digest, size_t digestSz)
{
    size_t words = digestSz / 4;
    size_t i;

    for (i = 0; i < words; i++)
        whal_StoreBe32(digest + i * 4,
                       whal_Reg_Read(base, HASH_HR_BASE_REG + i * 4));
}


/* ---- Direct API mapping (in-TU shadow defines) ---- */

#ifdef WHAL_CFG_STM32F4_HASH_INIT_DIRECT_API_MAPPING
#define whal_Stm32f4_Hash_Init           whal_Crypto_Init
#define whal_Stm32f4_Hash_Deinit         whal_Crypto_Deinit
#endif

#ifdef WHAL_CFG_STM32F4_HASH_SHA1_DIRECT_API_MAPPING
#define whal_Stm32f4_Sha1_Oneshot        whal_Sha1_Oneshot
#define whal_Stm32f4_Sha1_Start          whal_Sha1_Start
#define whal_Stm32f4_Sha1_Process        whal_Sha1_Process
#define whal_Stm32f4_Sha1_Finalize       whal_Sha1_Finalize
#endif

#ifdef WHAL_CFG_STM32F4_HASH_SHA224_DIRECT_API_MAPPING
#define whal_Stm32f4_Sha224_Oneshot      whal_Sha224_Oneshot
#define whal_Stm32f4_Sha224_Start        whal_Sha224_Start
#define whal_Stm32f4_Sha224_Process      whal_Sha224_Process
#define whal_Stm32f4_Sha224_Finalize     whal_Sha224_Finalize
#endif

#ifdef WHAL_CFG_STM32F4_HASH_SHA256_DIRECT_API_MAPPING
#define whal_Stm32f4_Sha256_Oneshot      whal_Sha256_Oneshot
#define whal_Stm32f4_Sha256_Start        whal_Sha256_Start
#define whal_Stm32f4_Sha256_Process      whal_Sha256_Process
#define whal_Stm32f4_Sha256_Finalize     whal_Sha256_Finalize
#endif

#ifdef WHAL_CFG_STM32F4_HASH_HMAC_SHA1_DIRECT_API_MAPPING
#define whal_Stm32f4_HmacSha1_Oneshot    whal_HmacSha1_Oneshot
#define whal_Stm32f4_HmacSha1_Start      whal_HmacSha1_Start
#define whal_Stm32f4_HmacSha1_Process    whal_HmacSha1_Process
#define whal_Stm32f4_HmacSha1_Finalize   whal_HmacSha1_Finalize
#endif

#ifdef WHAL_CFG_STM32F4_HASH_HMAC_SHA224_DIRECT_API_MAPPING
#define whal_Stm32f4_HmacSha224_Oneshot  whal_HmacSha224_Oneshot
#define whal_Stm32f4_HmacSha224_Start    whal_HmacSha224_Start
#define whal_Stm32f4_HmacSha224_Process  whal_HmacSha224_Process
#define whal_Stm32f4_HmacSha224_Finalize whal_HmacSha224_Finalize
#endif

#ifdef WHAL_CFG_STM32F4_HASH_HMAC_SHA256_DIRECT_API_MAPPING
#define whal_Stm32f4_HmacSha256_Oneshot  whal_HmacSha256_Oneshot
#define whal_Stm32f4_HmacSha256_Start    whal_HmacSha256_Start
#define whal_Stm32f4_HmacSha256_Process  whal_HmacSha256_Process
#define whal_Stm32f4_HmacSha256_Finalize whal_HmacSha256_Finalize
#endif


/* ---- Init / Deinit ---- */

whal_Error whal_Stm32f4_Hash_Init(whal_Crypto *dev)
{
    (void)dev;
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32f4_Hash_Deinit(whal_Crypto *dev)
{
    (void)dev;
    return WHAL_SUCCESS;
}

const whal_CryptoDriver whal_Stm32f4_Hash_CryptoDriver = {
    .Init = whal_Stm32f4_Hash_Init,
    .Deinit = whal_Stm32f4_Hash_Deinit,
};


/* ---- SHA-1 ---- */

whal_Error whal_Stm32f4_Sha1_Oneshot(whal_Sha1 *dev,
                                     const void *in, size_t inSz,
                                     void *digest, size_t digestSz)
{
    const whal_Stm32f4_Hash_Cfg *cfg =
        (const whal_Stm32f4_Hash_Cfg *)whal_Stm32f4_Hash_Dev.cfg;
    size_t base = whal_Stm32f4_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 20)
        return WHAL_EINVAL;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA1) | HASH_CR_INIT_Msk);

    if (inSz > 0) {
        if (!in)
            return WHAL_EINVAL;
        WriteTail(base, (const uint8_t *)in, inSz);
    }

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32f4_Sha1_Start(whal_Sha1 *dev)
{
    size_t base = whal_Stm32f4_Hash_Dev.base;
    (void)dev;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

    whal_Reg_Update(base, HASH_CR_REG,
                    HASH_CR_ALGO_Msk | HASH_CR_DATATYPE_Msk |
                    HASH_CR_MODE_Msk | HASH_CR_LKEY_Msk | HASH_CR_INIT_Msk,
                    AlgoBits(HASH_ALGO_SHA1) | HASH_CR_INIT_Msk);

    StreamReset();
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32f4_Sha1_Process(whal_Sha1 *dev,
                                     const void *in, size_t inSz)
{
    (void)dev;
    if (inSz == 0)
        return WHAL_SUCCESS;
    if (!in)
        return WHAL_EINVAL;
    StreamWrite(whal_Stm32f4_Hash_Dev.base, (const uint8_t *)in, inSz);
    return WHAL_SUCCESS;
}

whal_Error whal_Stm32f4_Sha1_Finalize(whal_Sha1 *dev,
                                      void *digest, size_t digestSz)
{
    const whal_Stm32f4_Hash_Cfg *cfg =
        (const whal_Stm32f4_Hash_Cfg *)whal_Stm32f4_Hash_Dev.cfg;
    size_t base = whal_Stm32f4_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 20)
        return WHAL_EINVAL;

    StreamDrain(base);

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_DCAL_Msk,
                    HASH_STR_DCAL_Msk);

    err = WaitForReady(base, cfg->timeout);
    if (err)
        return err;

    ReadDigest(base, (uint8_t *)digest, digestSz);
    return WHAL_SUCCESS;
}

const whal_Sha1Driver whal_Stm32f4_Hash_Sha1Driver = {
    .Oneshot = whal_Stm32f4_Sha1_Oneshot,
    .Start = whal_Stm32f4_Sha1_Start,
    .Process = whal_Stm32f4_Sha1_Process,
    .Finalize = whal_Stm32f4_Sha1_Finalize,
};


/* ---- SHA-224 ---- */

whal_Error whal_Stm32f4_Sha224_Oneshot(whal_Sha224 *dev,
                                       const void *in, size_t inSz,
                                       void *digest, size_t digestSz)
{
    const whal_Stm32f4_Hash_Cfg *cfg =
        (const whal_Stm32f4_Hash_Cfg *)whal_Stm32f4_Hash_Dev.cfg;
    size_t base = whal_Stm32f4_Hash_Dev.base;
    whal_Error err;
    (void)dev;

    if (!digest || digestSz != 28)
        return WHAL_EINVAL;

    whal_Reg_Update(base, HASH_STR_REG, HASH_STR_NBLW_Msk, 0);

